Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/savings_and_investments/comparing_interest_on_savings_and_investments.html.txt.tmx
Source language: en
Languages: ga

source: Interest on loans and savings
ga: Ús ar iasachtaí agus coigilteas

source: • Interest on borrowings and overdrafts
ga: • Ús ar iasachtaí agus ar rótharraingtí

source: Financial institutions such as banks, credit unions and building societies use different terms for the interest you are charged or earn on their financial products
ga: Úsáideann institiúidí airgeadais, ar nós banc, comhair chreidmheasa agus cumainn foirgníochta téarmaí éagsúla don ús a ghearrtar ort nó a thuilleann tú ar a dtáirgí airgeadais

source: The four most common terms you will see are:
ga: Is iad na ceithre théarma is coitianta a thabharfaidh tú faoi deara:

source: • Annual Percentage Rate (APR)
ga: • An Ráta Céatadánach Bliantúil (APR)

source: • Equivalent Annual Rate (EAR)
ga: • An Ráta Bliantúil Coibhéiseach (EAR)

source: • Annual Equivalent Rate (AER)
ga: • An Ráta Coibhéiseach Bliantúil (AER)

source: • Compound Annual Return (CAR)
ga: • Toradh Bliantúil Iolraithe (CAR)

source: APR and EAR are used for the interest you are charged on money you borrow
ga: Úsáidtear APR agus EAR don ús a ghearrtar ort ar airgead a fhaigheann tú ar iasacht

source: AER, CAR and EAR can be used for the interest you earn on money you save
ga: Féadtar AER, CAR agus EAR a úsáid don ús a thuilleann tú ar airgead a choiglíonn tú

source: Interest on borrowings and overdrafts
ga: Ús ar iasachtaí agus ar rótharraingtí

source: The Annual Percentage Rate (APR) is a calculation of the overall cost of your loan
ga: Is é an Ráta Céatadánach Bliantúil (APR) ríomh chostas fhoriomlán d’iasachta

source: It is expressed as an annual rate that represents the actual yearly cost of the funds borrowed
ga: Léirítear é mar ráta bliantúil a léiríonn costas iarbhír bliantúil na gcistí a fuarthas ar iasacht

source: It takes into account all the costs during the term of the loan including any set up charges and the interest rate
ga: Cuireann sé san áireamh na costais go léir i rith théarma na hiasachta, lena n-áirítear aon mhuirir bhunaithe agus an ráta úis

source: This means that fees and charges are added to the loan amount before interest is calculated
ga: Ciallaíonn seo go cuirtear táillí agus muirir le méid na hiasachta sula ríomhtar ús

source: APR is calculated each year on the declining principal of a loan
ga: Ríomhtar APR gach bliain ar phrionsabal laghdaithe iasachta

source: The declining principal is the amount you still owe, not the original amount you borrowed
ga: Is é an prionsabal laghdaithe an tsuim atá fós le haisíoc agat, seachas an tsuim a thóg tú ar iasacht

source: The higher the APR the more it will cost you to borrow money
ga: Dá airde an APR, is mó a chosnóidh sé ort airgead a fháil ar iasacht

source: All lenders are required to quote the interest rate on a loan or credit card as an APR
ga: Tá ar gach iasachtóir an ráta úis a lua ar iasacht nó ar chárta creidmheasa mar APR

source: These requirements are set down in Section 21 of the Consumer Credit Act 1995
ga: Tá na riachtanais seo leagtha síos in Alt 21 den Acht um Chreidmheas do Thomhaltóirí, 1995

source: You can use the APR to compare loans as long as they are for the same amount and the same term
ga: Féadfaidh tú an APR a úsáid chun iasachtaí a chur i gcomparáid lena chéile a fhad agus atá an tsuim chéanna agus an téarma céanna i gceist leo

source: For example, a loan with an APR of 15% is more expensive than one with an APR of 11%
ga: Mar shampla, cosnaíonn iasachta ag a bhfuil APR 15% níos mó ná iasacht le APR 11%

source: You cannot use APR to compare loans of different terms – if the terms are different you should look at the cost of credit
ga: Ní féidir leat an APR a úsáid chun comparáid a dhéanamh idir iasachtaí de théarmaí éagsúla – más éagsúil na téarmaí, ba cheart duit súil a chaitheamh ar chostas creidmheasa

source: The cost of credit is the real cost of borrowing
ga: Is ionann costas creidmheasa agus an fíorchostas a bhíonn ar iasacht a fháil

source: It is the difference between the amount you borrow and the total you repay
ga: Is é an difríocht atá idir an tsuim a thógann tú ar iasacht agus an t-iomlán a aisíocann tú

source: You can use the consumerhelp.ie loan calculator to work out the monthly repayments and cost of credit for loans depending on:
ga: Féadfaidh tú áireamhán iasachta consumerhelp.ie a úsáid leis na haisíocaíochtaí míosúla agus le costas creidmheasa d’iasachtaí a dheimhniú, ag brath ar an méid a leanas:

source: • How much you want to borrow or
ga: • Cé mhéid is mian leat a fháil ar iasacht, nó

source: • How much you can afford to pay back each month
ga: • Cé mhéid is féidir leat a íoc ar ais gach mí

source: The Equivalent Annual Rate (EAR) is used to calculate interest on accounts that can either be in credit or overdrawn
ga: Úsáidtear an Ráta Bliantúil Coibhéiseach (EAR) chun ús ar chuntais a ríomh nach féidir leo bheith ar sochar ná nach féidir iad a rótharraingt

source: (If you have money in your account, your account is in credit)
ga: (Má tá airgead i do chuntas agat, tá do chuntas ar sochar)

source: EAR shows you the rate of interest charged or earned
ga: Taispeánann an EAR duit an ráta úis a ghearrtar nó a thuilltear

source: For example, a current account with an overdraft facility can have 2 EAR rates – one for interest paid when the account is in credit and another for interest charged when the account is overdrawn
ga: Mar shampla, féadfaidh cuntas reatha ag a bhfuil áis rótharraingthe 2 ráta EAR a bheith aige – ceann amháin d’ús a íocadh nuair atá an cuntas ar sochar agus ceann eile d’ús a ghearrtar nuair a dhéantar rótharraingt ar an gcuntas

source: If only one EAR is quoted you should find out whether it applies to your credit balance or your overdraft
ga: Mura luaitear ach EAR amháin, ba cheart duit a dheimhniú an mbaineann seo le hiarmhéid do chreidmheasa nó le do rótharraingt

source: Always check the interest rate charged on your overdraft facility with your bank
ga: Seiceáil i gcónaí an ráta úis a ghearrtar ar d’áis rótharraingthe le do bhanc

source: EAR takes into account when the interest is charged or earned, and any additional charges
ga: Cuireann an EAR san áireamh cathain a ghearrtar nó a thuilltear an t-ús, agus aon mhuirir bhreise

source: Additional charges could include quarterly fees, set-up charges, and so on
ga: I measc na muirear breise, d’fhéadfadh táillí ráithiúla, muirir bhunaithe, agus mar sin de, a bheith i gceist

source: EAR calculates the interest as if it is paid once a year, even if it is paid twice or three times per year
ga: Ríomhann an EAR an t-ús amhail a íoctar uair sa bhliain é, fiú má íoctar dhá nó tríú huaire sa bhliain é

source: This allows you to use EAR rates to compare an account where the interest is paid or charged monthly with one where the interest is paid or charged annually
ga: Ceadaíonn seo duit rátaí EAR a úsáid chun comparáid a dhéanamh idir cuntas sa chás go n-íoctar nó go ngearrtar an t-ús gach mí agus cuntas ina n-íoctar nó ina ngearrtar an t-ús gach bliain

source: The higher the EAR, the more interest you will be charged or earn
ga: Dá airde an EAR, is mó ús a ghearrfar ort nó a thuillfidh tú

source: Annual Equivalent Rate (AER) and Compound Annual Return (CAR) both show you the real interest you will have gained on savings or interest-based investments at the end of a year
ga: Taispeánann an Ráta Coibhéiseach Bliantúil (AER) agus an Toradh Bliantúil Iolraithe (CAR) araon duit an fíor-ús a bheidh gnóthaithe agat ar choigilteas nó ar infheistíochtaí úsbhunaithe ag deireadh bliana

source: AER is the amount of interest earned in a year
ga: Is ionann an AER agus an méid úis a tuilleadh i mbliain

source: AER is useful for comparing the return on savings accounts because it shows how much is earned regardless of how often interest is credited to an account
ga: Tá AER áisiúil chun comparáid a dhéanamh idir an toradh ar chuntais choigiltis mar gheall go dtaispeánann sé cé mhéid a thuilltear gan aird ar cé chomh minic a chuirtear ús do shochar cuntais

source: It is standard practice in Ireland to list interest in AER form for savings accounts
ga: Cleachtas caighdeánach é in Éirinn chun ús a liostú i bhfoirm AER i gcás cuntais choigiltis

source: You may earn less than the AER because your money may not be invested for as long as a year
ga: Féadfaidh tú níos lú a thuilleamh ná an AER mar gheall nach ndearnadh d’airgead a infheistiú ar feadh a fhad le bliain

source: AER is usually quoted without taking DIRT into account
ga: Is gnách go luaitear an AER gan cáin choinneála ar ús taisce (DIRT) a chur san áireamh

source: Sometimes firms use Compound Annual Rate (CAR) instead of AER on savings and investment products
ga: Amanna, úsáideann gnóthais an Toradh Bliantúil Iolraithe (CAR) in ionad an AER ar tháirgí coigiltis agus infheistíochta

source: CAR is a measure of the rate of return on a deposit or investment
ga: Tomhas atá sa CAR ar ráta toraidh ar éarlais nó infheistíocht

source: You can use it to compare different accounts
ga: Féadfaidh tú é a úsáid chun cuntais éagsúla a chur i gcomparáid

source: If there is €110 in an account, a year after €100 was lodged in it the return, or CAR, is 10%
ga: Má tá €110 i gcuntas, bliain i ndiaidh gur cuireadh €100 i dtaisce ann, is ionann an toradh, nó an CAR, agus 10%

source: AER and CAR both take into account how often interest is paid because when the interest is added to your savings your savings increase
ga: Cuireann an AER agus an CAR san áireamh cé chomh minic a íoctar ús mar gheall go méadaítear do choigilteas nuair a shuimítear an t-ús leis

source: As a result, the next time the interest on your savings is calculated this increases too
ga: Mar thoradh air sin, an chéad uair eile a ríomhtar an t-ús ar do choigilteas, méadaítear seo chomh maith

source: This called compound interest
ga: Tugtar ús iolraithe air seo

source: An example of compound interest:
ga: Sampla d’ús iolraithe is ea:

source: If a financial institution quotes an interest rate of 4% per year compounded every 6 months the financial institution pays 2% compound interest every 6 months
ga: Má íocann institiúid airgeadais ráta úis 4% sa bhliain a dhéantar a iolrú gach 6 mhí, íocann an institiúid airgeadais ús iolraithe 2% gach 6 mhí

source: The interest paid at the end of 6 months, actually earns interest for the second 6 months of the year
ga: Déanann an t-ús a íoctar ag deireadh na 6 mhí an t-ús a thuilleamh don dara 6 mhí sa bhliain, mar a tharlaíonn

source: For this reason, 4% compounded every 6 months, is not the same as 4% compounded annually
ga: Ar an gcúis seo, ní hionann 4% a iolraítear gach 6 mhí agus 4% a iolraítear gach bliain

source: You invest €500 with your financial institution at a rate of 4% each year, compounded every 6 months
ga: Infheistíonn tú €500 le d’institiúid airgeadais ar ráta 4% gach bliain, a iolraítear gach 6 mhí

source: The €10 interest for the first 6 months is simply 2% of €500
ga: Go simplí, is ionann an t-ús €10 do na chéad 6 mhí agus 2% de €500

source: This is then added to the initial investment to give a running total of €510
ga: Suimítear é seo, ina dhiaidh sin, leis an infheistíocht tosaigh agus eascraíonn an méid reatha €510

source: The interest for the second six months of the year is 2% of €510 = €10.20
ga: Is é an t-ús don dara 6 mhí den bhliain agus 2% de €510 = €10.20

source: The effective annual interest rate is therefore 20.20 /500 x 100 = 4.04%
ga: Ar an ábhar sin, is é an ráta éifeachtach bliantúil úis 20.20 /500 x 100 = 4.04%

source: If a financial institution, quotes an AER or CAR rate for an account, there may also be terms and conditions attached to that account which can stop you from getting the full rate
ga: Má luann institiúid airgeadais ráta AER nó CAR do chuntas, d’fhéadfadh go mbeadh téarmaí agus coinníollacha i gceist leis an gcuntas sin ar féidir leo stop a chur leat ón ráta iomlán a fháil

source: For example, you may not get the full rate if you withdraw your savings before a certain date
ga: Mar shampla, b’fhéidir nach bhfaighidh tú an ráta iomlán má aistarraingíonn tú do choigilteas roimh dháta ar leith

source: AER and CAR do not take into account fees or charges
ga: Ní chuireann AER agus CAR táillí nó muirir chuntais san áireamh

source: If you have a complaint about a financial institution, contact the Financial Services Ombudsman Bureau
ga: Má bhíonn gearán agat faoi institiúid airgeadais, déan teagmháil le Biúró an Ombudsman um Sheirbhísí Airgeadais

source: If you feel that an advertisement in Ireland was misleading, you can make a complaint to the Advertising Standards Authority of Ireland
ga: Má bhraitheann tú go raibh fógraíocht in Éirinn míthreorach, féadfaidh tú gearán a dhéanamh le hÚdarás Caighdeáin Fógraíochta na hÉireann
